<a href="https://colab.research.google.com/github/singhbhupender1/ML-notebooks/blob/master/pandas_and_other_functions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
test = [{'Arizona': 'Phoenix', 'California': 'Sacramento', 'Hawaii': 'Honolulu'},
1000,
2000,
3000,
['hat', 't-shirt', 'jeans', {'socks1': 'red', 'socks2': 'blue'}]]

In [0]:
print(test[2])

2000

In [0]:
test[0]

{'Arizona': 'Phoenix', 'California': 'Sacramento', 'Hawaii': 'Honolulu'}

In [0]:
test[4]

['hat', 't-shirt', 'jeans', {'socks1': 'red', 'socks2': 'blue'}]

In [0]:
test[0]['Arizona']

'Phoenix'

In [0]:
test[4][2]

'jeans'

In [0]:
test[4][3]['socks2']

'blue'

In [0]:
a = 'muh'
a.replace('h', 'g')

'mug'

In [0]:
a = " myg  "
a.strip()

'myg'

In [0]:
a = 'hello world'
a.split(' ')

['hello', 'world']

In [0]:
' '.join(a)

'h e l l o   w o r l d'

In [0]:
a = [1, 2, 3, 4]
a.append('r')

In [0]:
a

[1, 2, 3, 4, 'r']

In [0]:
a.remove('r')

In [0]:
a

[1, 2, 3, 4]

In [0]:
test_yourself = [1, 1, 2, 2, 3, 3, 3, 3, 4, 5, 5]

In [0]:
sum(test_yourself) / len(test_yourself)

2.909090909090909

In [0]:
len(test_yourself)/2

5.5

In [0]:
test_yourself[round(len(test_yourself) /2) - 1]

3

In [0]:
import random

In [0]:
random.random() # import rrandom no between 0 and 1

0.8677229722430227

In [0]:
random.randint(1, 10) #generate random integer between specified values

3

In [0]:
import statistics

a = [1, 2, 3, 4, 5, 6]

In [0]:
print(statistics.mean(a))
print(statistics.median(a))
print(statistics.stdev(a))
print(statistics.variance(a))

3.5
3.5
1.8708286933869707
3.5

In [0]:
import datetime

In [0]:
datetime.datetime.now()

datetime.datetime(2020, 1, 24, 22, 25, 41, 849447)

In [0]:
datetime.datetime.now().strftime("%F")

'2020-01-24'

In [0]:
!wget 46.101.230.157/dilan/pandas_tutorial_read.csv

--2020-01-24 23:10:09--  http://46.101.230.157/dilan/pandas_tutorial_read.csv
Connecting to 46.101.230.157:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 110111 (108K) [application/octet-stream]
Saving to: ‘pandas_tutorial_read.csv’

pandas_tutorial_rea 100%[===================>] 107.53K  --.-KB/s    in 0.02s

2020-01-24 23:10:10 (4.74 MB/s) - ‘pandas_tutorial_read.csv’ saved [110111/110111]

In [0]:
import pandas as pd

In [0]:
pd.read_csv('pandas_tutorial_read.csv', delimiter=';')

      2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
0     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
1     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
2     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
3     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
4     2018-01-01 00:05:42  read  country_6  2458151266   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1789  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1790  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1791  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1792  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1793  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1794 rows x 6 columns]

In [0]:
pd.read_csv('pandas_tutorial_read.csv', delimiter=';', names=['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

              my_datetime event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [0]:
article_read = pd.read_csv('pandas_tutorial_read.csv', delimiter=';', names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

In [0]:
article_read

              my_datetime event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [0]:
article_read.head()

           my_datetime event    country     user_id   source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America

In [0]:
article_read.tail()

              my_datetime event    country     user_id   source          topic
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

In [0]:
article_read[['country', 'user_id']]

        country     user_id
0     country_7  2458151261
1     country_7  2458151262
2     country_7  2458151263
3     country_7  2458151264
4     country_8  2458151265
...         ...         ...
1790  country_2  2458153051
1791  country_8  2458153052
1792  country_6  2458153053
1793  country_7  2458153054
1794  country_5  2458153055

[1795 rows x 2 columns]

In [0]:
article_read[['user_id']]

         user_id
0     2458151261
1     2458151262
2     2458151263
3     2458151264
4     2458151265
...          ...
1790  2458153051
1791  2458153052
1792  2458153053
1793  2458153054
1794  2458153055

[1795 rows x 1 columns]

In [0]:
#get series insted of Dataframe
article_read.user_id

0       2458151261
1       2458151262
2       2458151263
3       2458151264
4       2458151265
           ...
1790    2458153051
1791    2458153052
1792    2458153053
1793    2458153054
1794    2458153055
Name: user_id, Length: 1795, dtype: int64

In [0]:
#or
article_read['user_id']

0       2458151261
1       2458151262
2       2458151263
3       2458151264
4       2458151265
           ...
1790    2458153051
1791    2458153052
1792    2458153053
1793    2458153054
1794    2458153055
Name: user_id, Length: 1795, dtype: int64

In [0]:
article_read.source =='SEO'

0        True
1        True
2       False
3       False
4       False
        ...
1790    False
1791     True
1792    False
1793    False
1794    False
Name: source, Length: 1795, dtype: bool

In [0]:
article_read[article_read.source =='SEO']

              my_datetime event    country     user_id source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11    2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15    2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16    2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America
...                   ...   ...        ...         ...    ...            ...
1772  2018-01-01 23:45:58  read  country_7  2458153033    SEO  South America
1777  2018-01-01 23:49:52  read  country_5  2458153038    SEO  North America
1779  2018-01-01 23:51:25  read  country_4  2458153040    SEO  South America
1784  2018-01-01 23:54:03  read  country_2  2458153045    SEO  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052    SEO           Asia

[346 rows x 6 columns]

In [0]:
article_read.head()[['country', 'user_id']]

     country     user_id
0  country_7  2458151261
1  country_7  2458151262
2  country_7  2458151263
3  country_7  2458151264
4  country_8  2458151265

In [0]:
article_read[['country', 'user_id']].head()

     country     user_id
0  country_7  2458151261
1  country_7  2458151262
2  country_7  2458151263
3  country_7  2458151264
4  country_8  2458151265

In [0]:
article_read[article_read.country == 'country_2'][['user_id', 'topic', 'country']].head()

       user_id   topic    country
6   2458151267  Europe  country_2
13  2458151274  Europe  country_2
17  2458151278    Asia  country_2
19  2458151280    Asia  country_2
20  2458151281    Asia  country_2

In [0]:
url = 'http://46.101.230.157/datacoding101/zoo.csv'
import pandas as pd
import numpy as np
zoo = pd.read_csv(url, delimiter=',')

In [0]:
#counting the number of animals or total rows
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [0]:
zoo[['animal']].count()

animal    22
dtype: int64

In [5]:
zoo.animal.count()

22

In [0]:
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [0]:
zoo[['water_need']].sum()

water_need    7650
dtype: int64

In [0]:
zoo.water_need.count()

22

In [0]:
zoo.water_need.min()

80

In [0]:
zoo.water_need.max()

600

In [0]:
zoo.water_need.mean()

347.72727272727275

In [0]:
zoo.water_need.median()

325.0

In [0]:
zoo[['water_need']].mean()

water_need    347.727273
dtype: float64

##groupin and aggregration
###Groupby
![grouping](https:/https://data36.com/wp-content/uploads/2018/07/pandas-grouping-explained-768x510.png)




```
variable + groupby() + mean()
```

In [0]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [0]:

zoo.groupby('animal').mean().water_need

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

In [0]:
import numpy as np
import pandas as pd
url = 'http://46.101.230.157/dilan/pandas_tutorial_read.csv'
article_read = pd.read_csv(url, delimiter=';', names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])
article_read

              my_datetime event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [0]:
article_read.groupby('source').count()

         my_datetime  event  country  user_id  topic
source
AdWords          500    500      500      500    500
Reddit           949    949      949      949    949
SEO              346    346      346      346    346

##most frequent topic and source combo from country_2
##i.e which topic from which source brought most views from cuntry_2

In [0]:
article_read[article_read.country == 'country_2'].groupby(['topic', 'source']).count()

                       my_datetime  event  country  user_id
topic         source
Africa        AdWords            3      3        3        3
              Reddit            24     24       24       24
              SEO                7      7        7        7
Asia          AdWords           31     31       31       31
              Reddit           139    139      139      139
              SEO                9      9        9        9
Australia     AdWords            6      6        6        6
              Reddit            18     18       18       18
              SEO               10     10       10       10
Europe        AdWords           46     46       46       46
              Reddit            29     29       29       29
              SEO                4      4        4        4
North America AdWords           11     11       11       11
              Reddit            27     27       27       27
              SEO               42     42       42       42
South America AdWords           14     14       14       14
              Reddit            26     26       26       26
              SEO               16     16       16       16

##MERGE == SQL join

In [0]:
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [0]:
import pandas as pd

In [0]:
zoo_eats = pd.DataFrame([['elephant','vegetables'], ['tiger','meat'], ['kangaroo','vegetables'], ['zebra','vegetables'], ['giraffe','vegetables']], columns=['animal', 'food'])

In [0]:
zoo_eats

     animal        food
0  elephant  vegetables
1     tiger        meat
2  kangaroo  vegetables
3     zebra  vegetables
4   giraffe  vegetables

In [0]:
zoo.merge(zoo_eats)

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200  vegetables
9      zebra     1010         220  vegetables
10     zebra     1011         240  vegetables
11     zebra     1012         230  vegetables
12     zebra     1013         220  vegetables
13     zebra     1014         100  vegetables
14     zebra     1015          80  vegetables
15  kangaroo     1020         410  vegetables
16  kangaroo     1021         430  vegetables
17  kangaroo     1022         410  vegetables

In [0]:
zoo_eats.merge(zoo)

      animal        food  uniq_id  water_need
0   elephant  vegetables     1001         500
1   elephant  vegetables     1002         600
2   elephant  vegetables     1003         550
3      tiger        meat     1004         300
4      tiger        meat     1005         320
5      tiger        meat     1006         330
6      tiger        meat     1007         290
7      tiger        meat     1008         310
8   kangaroo  vegetables     1020         410
9   kangaroo  vegetables     1021         430
10  kangaroo  vegetables     1022         410
11     zebra  vegetables     1009         200
12     zebra  vegetables     1010         220
13     zebra  vegetables     1011         240
14     zebra  vegetables     1012         230
15     zebra  vegetables     1013         220
16     zebra  vegetables     1014         100
17     zebra  vegetables     1015          80

In [6]:
zoo.merge(zoo_eats, how = 'outer')

      animal  uniq_id  water_need        food
0   elephant   1001.0       500.0  vegetables
1   elephant   1002.0       600.0  vegetables
2   elephant   1003.0       550.0  vegetables
3      tiger   1004.0       300.0        meat
4      tiger   1005.0       320.0        meat
5      tiger   1006.0       330.0        meat
6      tiger   1007.0       290.0        meat
7      tiger   1008.0       310.0        meat
8      zebra   1009.0       200.0  vegetables
9      zebra   1010.0       220.0  vegetables
10     zebra   1011.0       240.0  vegetables
11     zebra   1012.0       230.0  vegetables
12     zebra   1013.0       220.0  vegetables
13     zebra   1014.0       100.0  vegetables
14     zebra   1015.0        80.0  vegetables
15      lion   1016.0       420.0         NaN
16      lion   1017.0       600.0         NaN
17      lion   1018.0       500.0         NaN
18      lion   1019.0       390.0         NaN
19  kangaroo   1020.0       410.0  vegetables
20  kangaroo   1021.0       430.0  vegetables
21  kangaroo   1022.0       410.0  vegetables
22   giraffe      NaN         NaN  vegetables

In [8]:
##since no giraffe in zoo keeping it out would make sense but also keeping in lion s
#so we would use LEFT merge
zoo.merge(zoo_eats, how='left')

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200  vegetables
9      zebra     1010         220  vegetables
10     zebra     1011         240  vegetables
11     zebra     1012         230  vegetables
12     zebra     1013         220  vegetables
13     zebra     1014         100  vegetables
14     zebra     1015          80  vegetables
15      lion     1016         420         NaN
16      lion     1017         600         NaN
17      lion     1018         500         NaN
18      lion     1019         390         NaN
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables

In [9]:
##sorting values
zoo.sort_values('water_need')

      animal  uniq_id  water_need
14     zebra     1015          80
13     zebra     1014         100
8      zebra     1009         200
9      zebra     1010         220
12     zebra     1013         220
11     zebra     1012         230
10     zebra     1011         240
6      tiger     1007         290
3      tiger     1004         300
7      tiger     1008         310
4      tiger     1005         320
5      tiger     1006         330
18      lion     1019         390
19  kangaroo     1020         410
21  kangaroo     1022         410
15      lion     1016         420
20  kangaroo     1021         430
17      lion     1018         500
0   elephant     1001         500
2   elephant     1003         550
16      lion     1017         600
1   elephant     1002         600

In [11]:
#if sorting multiple columns use "by"
zoo.sort_values(by= ['animal', 'water_need'])

      animal  uniq_id  water_need
0   elephant     1001         500
2   elephant     1003         550
1   elephant     1002         600
19  kangaroo     1020         410
21  kangaroo     1022         410
20  kangaroo     1021         430
18      lion     1019         390
15      lion     1016         420
17      lion     1018         500
16      lion     1017         600
6      tiger     1007         290
3      tiger     1004         300
7      tiger     1008         310
4      tiger     1005         320
5      tiger     1006         330
14     zebra     1015          80
13     zebra     1014         100
8      zebra     1009         200
9      zebra     1010         220
12     zebra     1013         220
11     zebra     1012         230
10     zebra     1011         240

In [12]:
#by default it is "ascending order"
zoo.sort_values(by=['water_need'], ascending=False)

      animal  uniq_id  water_need
1   elephant     1002         600
16      lion     1017         600
2   elephant     1003         550
0   elephant     1001         500
17      lion     1018         500
20  kangaroo     1021         430
15      lion     1016         420
19  kangaroo     1020         410
21  kangaroo     1022         410
18      lion     1019         390
5      tiger     1006         330
4      tiger     1005         320
7      tiger     1008         310
3      tiger     1004         300
6      tiger     1007         290
10     zebra     1011         240
11     zebra     1012         230
9      zebra     1010         220
12     zebra     1013         220
8      zebra     1009         200
13     zebra     1014         100
14     zebra     1015          80

In [13]:
##after doing transformation you migh t have to reset index 
zoo.sort_values(by=['water_need'], ascending=False).reset_index()

    index    animal  uniq_id  water_need
0       1  elephant     1002         600
1      16      lion     1017         600
2       2  elephant     1003         550
3       0  elephant     1001         500
4      17      lion     1018         500
5      20  kangaroo     1021         430
6      15      lion     1016         420
7      19  kangaroo     1020         410
8      21  kangaroo     1022         410
9      18      lion     1019         390
10      5     tiger     1006         330
11      4     tiger     1005         320
12      7     tiger     1008         310
13      3     tiger     1004         300
14      6     tiger     1007         290
15     10     zebra     1011         240
16     11     zebra     1012         230
17      9     zebra     1010         220
18     12     zebra     1013         220
19      8     zebra     1009         200
20     13     zebra     1014         100
21     14     zebra     1015          80

In [14]:
#if we want to drop the old indexes
zoo.sort_values(by=['water_need'], ascending=False).reset_index(drop=True)

      animal  uniq_id  water_need
0   elephant     1002         600
1       lion     1017         600
2   elephant     1003         550
3   elephant     1001         500
4       lion     1018         500
5   kangaroo     1021         430
6       lion     1016         420
7   kangaroo     1020         410
8   kangaroo     1022         410
9       lion     1019         390
10     tiger     1006         330
11     tiger     1005         320
12     tiger     1008         310
13     tiger     1004         300
14     tiger     1007         290
15     zebra     1011         240
16     zebra     1012         230
17     zebra     1010         220
18     zebra     1013         220
19     zebra     1009         200
20     zebra     1014         100
21     zebra     1015          80

In [15]:
#fill na used inplace of NaN values
#it means unknown
zoo.merge(zoo_eats, how='left').fillna('unknown')

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200  vegetables
9      zebra     1010         220  vegetables
10     zebra     1011         240  vegetables
11     zebra     1012         230  vegetables
12     zebra     1013         220  vegetables
13     zebra     1014         100  vegetables
14     zebra     1015          80  vegetables
15      lion     1016         420     unknown
16      lion     1017         600     unknown
17      lion     1018         500     unknown
18      lion     1019         390     unknown
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables

In [16]:
zoo.merge(zoo_eats, how='left').fillna('meat')

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200  vegetables
9      zebra     1010         220  vegetables
10     zebra     1011         240  vegetables
11     zebra     1012         230  vegetables
12     zebra     1013         220  vegetables
13     zebra     1014         100  vegetables
14     zebra     1015          80  vegetables
15      lion     1016         420        meat
16      lion     1017         600        meat
17      lion     1018         500        meat
18      lion     1019         390        meat
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables

In [17]:
!wget http://46.101.230.157/dilan/pandas_tutorial_read.csv

--2020-01-25 20:41:32--  http://46.101.230.157/dilan/pandas_tutorial_read.csv
Connecting to 46.101.230.157:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 110111 (108K) [application/octet-stream]
Saving to: ‘pandas_tutorial_read.csv’

pandas_tutorial_rea 100%[===================>] 107.53K  --.-KB/s    in 0.02s

2020-01-25 20:41:32 (4.69 MB/s) - ‘pandas_tutorial_read.csv’ saved [110111/110111]

In [0]:
article_read = pd.read_csv('pandas_tutorial_read.csv', delimiter=';', names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

In [19]:
!wget 46.101.230.157/dilan/pandas_tutorial_buy.csv
blog_buy = pd.read_csv('pandas_tutorial_buy.csv', delimiter=';', names = ['my_date_time', 'event', 'user_id', 'amount'])

--2020-01-25 20:42:36--  http://46.101.230.157/dilan/pandas_tutorial_buy.csv
Connecting to 46.101.230.157:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 2625 (2.6K) [application/octet-stream]
Saving to: ‘pandas_tutorial_buy.csv’

pandas_tutorial_buy 100%[===================>]   2.56K  --.-KB/s    in 0s

2020-01-25 20:42:36 (380 MB/s) - ‘pandas_tutorial_buy.csv’ saved [2625/2625]

In [20]:
blog_buy

           my_date_time event     user_id  amount
0   2018-01-01 04:04:59   buy  2458151555       8
1   2018-01-01 09:28:00   buy  2458151933       8
2   2018-01-01 13:23:16   buy  2458152245       8
3   2018-01-01 14:20:43   buy  2458152315     100
4   2018-01-02 02:57:43   buy  2458153264       8
..                  ...   ...         ...     ...
65  2018-01-07 18:44:58   buy  2458157339       8
66  2018-01-07 19:09:53   buy  2458157601       8
67  2018-01-07 20:24:35   buy  2458157193       8
68  2018-01-07 22:11:28   buy  2458157128       8
69  2018-01-07 23:58:19   buy  2458159286       8

[70 rows x 4 columns]

In [25]:
article_read

              my_datetime event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [0]:
step_1 = article_read.merge(blog_buy, how='left', left_on = 'user_id', right_on='user_id')

In [27]:
step_1

              my_datetime event_x  ... event_y  amount
0     2018-01-01 00:01:01    read  ...     NaN     NaN
1     2018-01-01 00:03:20    read  ...     NaN     NaN
2     2018-01-01 00:04:01    read  ...     NaN     NaN
3     2018-01-01 00:04:02    read  ...     NaN     NaN
4     2018-01-01 00:05:03    read  ...     NaN     NaN
...                   ...     ...  ...     ...     ...
1790  2018-01-01 23:57:14    read  ...     NaN     NaN
1791  2018-01-01 23:58:33    read  ...     buy     8.0
1792  2018-01-01 23:59:36    read  ...     NaN     NaN
1793  2018-01-01 23:59:36    read  ...     NaN     NaN
1794  2018-01-01 23:59:38    read  ...     NaN     NaN

[1795 rows x 9 columns]

In [29]:
step_2 = step_1.amount
step_2

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
1790    NaN
1791    8.0
1792    NaN
1793    NaN
1794    NaN
Name: amount, Length: 1795, dtype: float64

In [0]:
step_3 = step_2.fillna(0)

In [0]:
result = step_3.mean()

In [35]:
result

1.0852367688022284

In [36]:
step_1 = article_read.merge(blog_buy, how='left', left_on='user_id', right_on='user_id')
step_1

              my_datetime event_x  ... event_y  amount
0     2018-01-01 00:01:01    read  ...     NaN     NaN
1     2018-01-01 00:03:20    read  ...     NaN     NaN
2     2018-01-01 00:04:01    read  ...     NaN     NaN
3     2018-01-01 00:04:02    read  ...     NaN     NaN
4     2018-01-01 00:05:03    read  ...     NaN     NaN
...                   ...     ...  ...     ...     ...
1790  2018-01-01 23:57:14    read  ...     NaN     NaN
1791  2018-01-01 23:58:33    read  ...     buy     8.0
1792  2018-01-01 23:59:36    read  ...     NaN     NaN
1793  2018-01-01 23:59:36    read  ...     NaN     NaN
1794  2018-01-01 23:59:38    read  ...     NaN     NaN

[1795 rows x 9 columns]

In [38]:
step_2 = step_1.fillna(0)
step_2

              my_datetime event_x  ... event_y  amount
0     2018-01-01 00:01:01    read  ...       0     0.0
1     2018-01-01 00:03:20    read  ...       0     0.0
2     2018-01-01 00:04:01    read  ...       0     0.0
3     2018-01-01 00:04:02    read  ...       0     0.0
4     2018-01-01 00:05:03    read  ...       0     0.0
...                   ...     ...  ...     ...     ...
1790  2018-01-01 23:57:14    read  ...       0     0.0
1791  2018-01-01 23:58:33    read  ...     buy     8.0
1792  2018-01-01 23:59:36    read  ...       0     0.0
1793  2018-01-01 23:59:36    read  ...       0     0.0
1794  2018-01-01 23:59:38    read  ...       0     0.0

[1795 rows x 9 columns]

In [43]:
step_3 = step_2.groupby('country').sum()
step_3

                 user_id  amount
country
country_1    88493475872     0.0
country_2  1135666294624   296.0
country_3    88493478779     0.0
country_4   199110330169  1112.0
country_5  1005384250148   324.0
country_6   602247275052     0.0
country_7   916890735956   200.0
country_8   376097283010    16.0

In [41]:
step_4 = step_3.amount
step_4

country
country_1       0.0
country_2     296.0
country_3       0.0
country_4    1112.0
country_5     324.0
country_6       0.0
country_7     200.0
country_8      16.0
Name: amount, dtype: float64

In [0]:
step_5 = step_4.sort_values(ascending=False)

In [45]:
step_5

country
country_4    1112.0
country_5     324.0
country_2     296.0
country_7     200.0
country_8      16.0
country_6       0.0
country_3       0.0
country_1       0.0
Name: amount, dtype: float64

In [46]:
step_5.head(3)

country
country_4    1112.0
country_5     324.0
country_2     296.0
Name: amount, dtype: float64

In [0]:
dog = ['Freddie', 9, True, 1.1, 2001, ['bone', 'little ball']]

In [48]:
for i in dog:
  print(i)

Freddie
9
True
1.1
2001
['bone', 'little ball']

In [51]:
my_list = [1, 5, 12, 91, 102]
my_list_length = len(my_list)
for i in range(0, my_list_length):
  print(i, my_list[i] *my_list[i])

0 1
1 25
2 144
3 8281
4 10404

In [53]:
my_string = "python"
x = 0

for i in my_string:
  x = x + 1
  print(my_string[0:x])

for i in my_string:
  x = x - 1
  print(my_string[0:x])

p
py
pyt
pyth
pytho
python
pytho
pyth
pyt
py
p

In [0]:
my_movies = [['How I met Your Mother', 'Friends', 'Silicon valley'], 
             ['Family Guy', 'South Park', 'Rick and  Morty'],
             ['Breaking Bad', 'Game of Thrones', 'The Wire']]

In [57]:
for sub_list in my_movies:
  for movie_name in sub_list:
    char_num = len(movie_name)
    print("the title " + movie_name + " is " + str(char_num) + " characters long.")

the title How I met Your Mother is 21 characters long.
the title Friends is 7 characters long.
the title Silicon valley is 14 characters long.
the title Family Guy is 10 characters long.
the title South Park is 10 characters long.
the title Rick and  Morty is 15 characters long.
the title Breaking Bad is 12 characters long.
the title Game of Thrones is 15 characters long.
the title The Wire is 8 characters long.

In [58]:
for i in range(99):
  if i % 3 == 0 and i % 5 == 0:
    print('fizzbuzz')
  elif i % 5 == 0:
    print('buzz')
  elif i %  3 == 0:
    print('fizz')
  else:
    print('-')

fizzbuzz
-
-
fizz
-
buzz
fizz
-
-
fizz
buzz
-
fizz
-
-
fizzbuzz
-
-
fizz
-
buzz
fizz
-
-
fizz
buzz
-
fizz
-
-
fizzbuzz
-
-
fizz
-
buzz
fizz
-
-
fizz
buzz
-
fizz
-
-
fizzbuzz
-
-
fizz
-
buzz
fizz
-
-
fizz
buzz
-
fizz
-
-
fizzbuzz
-
-
fizz
-
buzz
fizz
-
-
fizz
buzz
-
fizz
-
-
fizzbuzz
-
-
fizz
-
buzz
fizz
-
-
fizz
buzz
-
fizz
-
-
fizzbuzz
-
-
fizz
-
buzz
fizz
-
-

In [59]:
for i in range (0, 10000000, 137):
  if len(str(i)) == 7:
    print(i)
    break

1000100

In [66]:
own = 0
up = 100
for i in range(1,10):
    guessed_age = int((up + down) / 2)
    answer = input('Are you ' + str(guessed_age) + " years old?")
    if answer == 'correct':
        print("Nice")
        break
    elif answer == 'less':
        up = guessed_age
    elif answer == 'more':
        down = guessed_age
    else:
        print('wrong answer')

Are you 50 years old?less
Are you 25 years old?more
Are you 37 years old?less
Are you 31 years old?less
Are you 28 years old?more
Are you 29 years old?correct
Nice